src/Catalogs/ХозОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ХозОперации</Name>
			<Comment>Хозяйственные операции. Содержит предопределенный классификатор операций и видов проводок конфигурации</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыНоменклатуры</Name>
					<Comment>Виды номенклатуры</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Comment>Вид номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДоговоров</Name>
					<Comment>Виды договоров</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоговора</Name>
							<Comment>Вид договора</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/СтратегияСписанияПартийТоваровПоДатам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтратегияСписанияПартийТоваровПоДатам</Name>
			<Comment>Стратегия списания партий товаров по датам</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФИФО</Name>
					<Comment>По методу ФИФО</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛИФО</Name>
					<Comment>По методу ЛИФО</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средняя</Name>
					<Comment>По средней себестоимости</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
			<Comment>Виды договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Договоры с поставщиками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Договоры с покупателями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>Договор комиссии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>Договор с комитентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Общий договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Договор кредита</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
					<Comment>По умолчанию для контрагентов такого вида выбирается именно такой тип договора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
					<Comment>Зарплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратнаяТара</Name>
					<Comment>Договор по возвратной таре</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переработка</Name>
					<Comment>Переработка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийДоговора</Name>
			<Comment>Виды операций договора</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Операция покупки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Операция продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
					<Comment>Внутренняя операция</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ХозОперации/Ext/ManagerModule.bsl
// Модуль менеджера справочника "ХозОперации"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	Для Каждого ТекущийМакет Из Метаданные.Справочники.ХозОперации.Макеты Цикл
		Если СтрНайти(ТекущийМакет.Имя, "НачальноеЗаполнение") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстXML = Справочники.ХозОперации.ПолучитьМакет(ТекущийМакет.Имя);
		
		СтруктураХозОпераций = ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстXML.ПолучитьТекст());
		
		Если НЕ ТипЗнч(СтруктураХозОпераций) = Тип("Структура") Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого ТекОперация Из СтруктураХозОпераций Цикл
			
			ОперацияОбъект = Справочники.ХозОперации[ТекОперация.Ключ].ПолучитьОбъект();
			
			РеквизитыСправочника = ТекОперация.Значение;
			
			ЗаполнитьЗначенияСвойств(ОперацияОбъект, РеквизитыСправочника);
			ОперацияОбъект.ВидыНоменклатуры.Очистить();
			ОперацияОбъект.ВидыДоговоров.Очистить();
			
			Если РеквизитыСправочника.Свойство("Таблицы") Тогда
				ТаблицыСправочника = РеквизитыСправочника.Таблицы;
				Если ТаблицыСправочника.Свойство("ВидыНоменклатуры") Тогда
					Для Каждого ТекСтрока Из ТаблицыСправочника.ВидыНоменклатуры Цикл
						НоваяСтрока = ОперацияОбъект.ВидыНоменклатуры.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
					КонецЦикла;
				КонецЕсли;
				
				Если ТаблицыСправочника.Свойство("ВидыДоговоров") Тогда
					Для Каждого ТекСтрока Из ТаблицыСправочника.ВидыДоговоров Цикл
						НоваяСтрока = ОперацияОбъект.ВидыДоговоров.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			ОперацияОбъект.ОбменДанными.Загрузка = Истина;
			ОперацияОбъект.Записать();
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

// Составляет список возможных хоз. операций для объекта.
//
Функция ПолучитьСписокХозОпераций(Объект) Экспорт
	
	СписокИсключений = Новый СписокЗначений;
	ИмяДокумента = "Документ_" + Метаданные.НайтиПоТипу(ТипЗнч(Объект)).Имя;
	
	// сюда заходим только если у нас есть объект/ссылка и есть реквизит "Склад"
	Если СтрНайти(Строка(ТипЗнч(Объект)), "менеджер") = 0 И Метаданные.НайтиПоТипу(ТипЗнч(Объект)).Реквизиты.Найти("СкладКомпании") <> Неопределено Тогда
		ЗначениеУчетнойПолитики = ПолучитьСтратегиюСписанияПоДатам(Объект.СкладКомпании, Объект.Организация, Объект.Дата);
		Если ЗначениеУчетнойПолитики = Перечисления.СтратегияСписанияПартийТоваровПоДатам.Средняя Тогда
			СписокИсключений.Добавить(Справочники.ХозОперации.ПоступлениеТоваровКомиссия);
			СписокИсключений.Добавить(Справочники.ХозОперации.ВводОстатковТоваровПринятыхНаКомиссию);
		КонецЕсли;
	КонецЕсли;
	
	// программно проверяем доступность хоз. операций для документа "Корректировка"
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.КорректировкаДвижений") ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.КорректировкаДвижений") Тогда
		Если НЕ РольПользователя("РазрешитьКорректировкуРегистров") Тогда
			СписокИсключений.Добавить(Справочники.ХозОперации.КорректировкаДвижений);
		КонецЕсли;
		Если НЕ РольПользователя("РазрешитьСторнированиеДокументов") Тогда
			СписокИсключений.Добавить(Справочники.ХозОперации.Сторно);
		КонецЕсли;
	КонецЕсли;
	
	// программно проверяем доступность хоз. операций для документа "Переоценка"
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.Переоценка") ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.Переоценка") Тогда
		Если НЕ Константы.ИспользоватьРозничнаяТорговля.Получить() Тогда
			СписокИсключений.Добавить(Справочники.ХозОперации.ПереоценкаТоваровВРознице);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ОтчетПроизводстваЗаСмену") ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.ОтчетПроизводстваЗаСмену") Тогда
		СписокИсключений.Добавить(Справочники.ХозОперации.ВложенныйВыпускПолуфабрикатов);
		СписокИсключений.Добавить(Справочники.ХозОперации.ПередачаИнгредиентовВПроизводство);
		СписокИсключений.Добавить(Справочники.ХозОперации.ПередачаПолуфабрикатовВПроизводство);
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗакрытиеСмены") ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.ЗакрытиеСмены") Тогда
		СписокИсключений.Добавить(Справочники.ХозОперации.ЗакрытиеСменыВозврат);
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ВозвратПоставщику") ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
		СписокИсключений.Добавить(Справочники.ХозОперации.ВозвратПоставщикуКорректировкаСебестоимостиПартии);
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.Инвентаризация") ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.Инвентаризация") Тогда
		СписокИсключений.Добавить(Справочники.ХозОперации.ИнвентаризацияТоваровВыравниваниеОстатков);
	КонецЕсли;
	
	Если (ТипЗнч(Объект) = Тип("ДокументОбъект.УценкаТовара") ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.УценкаТовара")) И Объект.ДокументЦентральногоОфиса=Ложь Тогда
		СписокИсключений.Добавить(Справочники.ХозОперации.УценкаОвощей);
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.КорректировкаПоступления") ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		//СписокИсключений.Добавить(Справочники.ХозОперации.КорректировкаПоступленияКорректировкаБезОснования);
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.КорректировкаРеализации") ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		//СписокИсключений.Добавить(Справочники.ХозОперации.КорректировкаРеализацииКорректировкаБезОснования);
	КонецЕсли;
	
	РазрешитьПеремещениеМеждуФилиалам = ПравоПользователя("РазрешитьПеремещениеМеждуФилиалам");
	Если РазрешитьПеремещениеМеждуФилиалам = Ложь Тогда
		СписокИсключений.Добавить(Справочники.ХозОперации.ПеремещениеТоваровВФилиал);
		СписокИсключений.Добавить(Справочники.ХозОперации.ПеремещениеТоваровИзФилиала);
	КонецЕсли;
	
	СписокХозОпераций = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозОперации.ИмяПредопределенныхДанных КАК Имя,
	|	ХозОперации.Наименование
	|ИЗ
	|	Справочник.ХозОперации КАК ХозОперации
	|ГДЕ
	|	ХозОперации.Родитель = &Родитель
	|	И (НЕ ХозОперации.Ссылка В (&СписокИсключений))
	|	И ХозОперации.ПометкаУдаления = ЛОЖЬ
	|	И ХозОперации.ЭтоГруппа = ЛОЖЬ
	|	%ОтборПоКомиссии%
	|УПОРЯДОЧИТЬ ПО
	|	ХозОперации.РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("Родитель",         Справочники.ХозОперации[ИмяДокумента]);
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
	
	// Отбор по комиссии - если опция ИспользоватьКомиссионнаяТорговля выключена, то
	// выбираем только те элементы, у которых флаг "Комиссия" установлен в ЛОЖЬ
	// иначе отбор по комиссии не производится.
	ОтборПоКомиссии = "";
	Если НЕ Константы.ИспользоватьКомиссионнаяТорговля.Получить() Тогда
		ОтборПоКомиссии = " И ХозОперации.Комиссия = ЛОЖЬ ";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ОтборПоКомиссии%", ОтборПоКомиссии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокХозОпераций.Добавить(Выборка.Имя, Выборка.Наименование);
	КонецЦикла;
	
	Если СписокХозОпераций.Количество()> 0 Тогда
		СписокХозОпераций[0].Пометка = Истина;
	КонецЕсли;
	
	Возврат СписокХозОпераций;
	
КонецФункции // ПолучитьСписокХозОпераций()

Функция ПолучитьХозОперациюПоУмолчанию(Объект) Экспорт
	
	СписокХозОпераций = ПолучитьСписокХозОпераций(Объект);
	Если СписокХозОпераций.Количество()> 0 Тогда
		Результат = Справочники.ХозОперации[СписокХозОпераций[0].Значение];
	Иначе
		Результат = Справочники.ХозОперации.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьХозОперациюПоУмолчанию()

// Функция для проверки соответствия ХозОперации объекта из списка доступных ХозОпераций для данного объекта.
//
Функция ПолучитьСоответствиеХозОперацииОбъекта(Объект) Экспорт
	
	// Получим список доступных ХозОпераций для данного объекта
	СписокДоступныхХозОпераций = ПолучитьСписокХозОпераций(Объект);
	
	Возврат НЕ СписокДоступныхХозОпераций.НайтиПоЗначению(Объект.ХозОперация.ИмяПредопределенныхДанных) = Неопределено;
	
КонецФункции // ПолучитьСоответствиеХозОперацииОбъекта()

Функция СоответствуетВидуОперации(ХозОперация, ВидОперации) Экспорт
	
	Возврат ХозОперация.ВидОперации = ВидОперации;
	
КонецФункции // СоответствуетВидуОперации()

Функция ПолучитьВидыНоменклатуры(ХозОперация) Экспорт
	
	ВидыНоменклатуры = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозОперацииВидыНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.ХозОперации.ВидыНоменклатуры КАК ХозОперацииВидыНоменклатуры
	|ГДЕ
	|	ХозОперацииВидыНоменклатуры.Ссылка = &ХозОперация
	|";
	
	Запрос.УстановитьПараметр("ХозОперация", ХозОперация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидыНоменклатуры.Добавить(Выборка.ВидНоменклатуры);
	КонецЦикла;
	
	Возврат ВидыНоменклатуры;
	
КонецФункции // ПолучитьВидыНоменклатуры()

Функция ПолучитьВидыДоговоров(ХозОперация) Экспорт
	
	ВидыДоговоров = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозОперацииВидыДоговоров.ВидДоговора
	|ИЗ
	|	Справочник.ХозОперации.ВидыДоговоров КАК ХозОперацииВидыДоговоров
	|ГДЕ
	|	ХозОперацииВидыДоговоров.Ссылка = &ХозОперация
	|УПОРЯДОЧИТЬ ПО
	|	ХозОперацииВидыДоговоров.НомерСтроки";
	
	Запрос.УстановитьПараметр("ХозОперация", ХозОперация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидыДоговоров.Добавить(Выборка.ВидДоговора);
	КонецЦикла;
	
	Возврат ВидыДоговоров;
	
КонецФункции // ПолучитьВидыДоговоров()

Функция ПолучитьВидДоговора(ХозОперация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ХозОперацииВидыДоговоров.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Справочник.ХозОперации.ВидыДоговоров КАК ХозОперацииВидыДоговоров
	|ГДЕ
	|	ХозОперацииВидыДоговоров.Ссылка = &ХозОперация
	|УПОРЯДОЧИТЬ ПО
	|	ХозОперацииВидыДоговоров.НомерСтроки";
	
	Запрос.УстановитьПараметр("ХозОперация", ХозОперация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВидДоговора = Выборка.ВидДоговора;
	Иначе
		ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	КонецЕсли;
	
	Возврат ВидДоговора;
	
КонецФункции // ПолучитьВидДоговора()

Функция ДоговорСоответствуетХозОперации(ХозОперация, ДоговорВзаиморасчетов) Экспорт
	
	ВидыДоговоров = ПолучитьВидыДоговоров(ХозОперация);
	
	Возврат (НЕ ВидыДоговоров.Найти(ДоговорВзаиморасчетов.ВидДоговора) = Неопределено);
	
КонецФункции // ДоговорСоответствуетХозОперации()

Функция ПолучитьОсновнойТипЦен(ХозОперация) Экспорт
	
	Если ХозОперация.ВидОперации = Перечисления.ВидыОперацийДоговора.Покупка Тогда
		ТипЦен = ПравоПользователя("ОсновнойТипЦенЗакупки");
	ИначеЕсли ХозОперация.ВидОперации = Перечисления.ВидыОперацийДоговора.Продажа Тогда
		ТипЦен = ПравоПользователя("ОсновнойТипЦенПродажи");
	Иначе
		ТипЦен = ПравоПользователя("ОсновнойТипЦенЗакупки");
	КонецЕсли;
	
	Возврат ТипЦен;
	
КонецФункции // ПолучитьОсновнойТипЦен()

Функция ПолучитьОсновнойТипЦенДоговора(ХозОперация, Договор) Экспорт
	
	ТипЦен = Договор.ТипЦен;
	
	Возврат ТипЦен;
	
КонецФункции // ПолучитьОсновнойТипЦенДоговора()

// Используется в начальной обработке заполнения
Функция ПолучитьОсновногоКонтрагента(ХозОперация) Экспорт
	
	Если ХозОперация.ВидОперации = Перечисления.ВидыОперацийДоговора.Покупка Тогда
		ОсновнойКонтрагент = ПравоПользователя("ОсновнойПоставщик");
	ИначеЕсли ХозОперация.ВидОперации = Перечисления.ВидыОперацийДоговора.Продажа Тогда
		ОсновнойКонтрагент = ПравоПользователя("ОсновнойПокупатель");
	Иначе
		ОсновнойКонтрагент = Неопределено;
	КонецЕсли;
	
	Возврат ОсновнойКонтрагент;
	
КонецФункции // ПолучитьОсновногоКонтрагента()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	
	// Обработаем в зависимости от вида элемента
	Если НЕ Объект.ЭтоГруппа Тогда
	КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("ВидОперации");
	
	ОбязательныеРеквизиты.Добавить("ВидыНоменклатуры.ВидНоменклатуры");
	ОбязательныеРеквизиты.Добавить("ВидыДоговоров.ВидДоговора");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
